{"content":"    <!-- ENUM -->\r\n    <h1 id=\"System_Diagnostics_PerformanceCounterType\">\r\n      <span class=\"lang-csharp\">PerformanceCounterType</span>\r\n        Enum\r\n    </h1>\r\n    \r\n    \r\n    <nav id=\"center-doc-outline\" class=\"doc-outline\" ms.cmpgrp=\"intopic toc\" role=\"navigation\" aria-label=\"On page navigation\">\r\n      <h3>In this Article</h3>\r\n    </nav><div class=\"summary\">\r\n    \t<p>Specifies the formula used to calculate the <span class=\"xref\">stem.Diagnostics.PerformanceCounter.NextValue*</span> method for a <a class=\"xref\" href=\"system.diagnostics.performancecounter\" data-linktype=\"relative-path\">PerformanceCounter</a> instance.</p>\n\r\n    </div><h2>Syntax</h2>\r\n    \r\n    \t<h3>Declaration</h3>\r\n    \t<pre class=\"memberDeclaration\"><code class=\"csharp lang-csharp\">[System.ComponentModel.TypeConverter(typeof(System.Diagnostics.AlphabeticalEnumConverter))]\npublic enum PerformanceCounterType</code></pre>\r\n    \r\n    \r\n    \r\n    <h3>Inheritance Hierarchy</h3>\r\n    <ul class=\"inheritance\">\r\n        <li class=\"l0\">\r\n          <div class=\"lang-csharp\">\r\n            <a class=\"xref\" href=\"system.object\" data-linktype=\"relative-path\">Object</a>\r\n          </div>\r\n        </li>\r\n        <li class=\"l1\">\r\n          <div class=\"lang-csharp\">\r\n            <a class=\"xref\" href=\"system.valuetype\" data-linktype=\"relative-path\">ValueType</a>\r\n          </div>\r\n        </li>\r\n        <li class=\"l2\">\r\n          <div class=\"lang-csharp\">\r\n            <a class=\"xref\" href=\"system.enum\" data-linktype=\"relative-path\">System.Enum</a>\r\n          </div>\r\n        </li>\r\n      <li class=\"l3\">\r\n        <div class=\"xref\">\r\n          <div class=\"lang-csharp\">PerformanceCounterType</div>\r\n        </div>\r\n      </li>\r\n    </ul>\r\n    \r\n    \r\n    \r\n      <h2>Remarks</h2>\r\n      <p>Some counter types represent raw data, while others represent calculated values that are based on one or more counter samples. The following categories classify the types of counters available.  </p>\n<ul>\n<li><p>Average: measure a value over time and display the average of the last two measurements. Associated with each average counter is a base counter that tracks the number of samples involved.  </p>\n</li>\n<li><p>Difference: subtract the last measurement from the previous one and display the difference, if it is positive; if negative, they display a zero.  </p>\n</li>\n<li><p>Instantaneous: display the most recent measurement.  </p>\n</li>\n<li><p>Percentage: display calculated values as a percentage.  </p>\n</li>\n<li><p>Rate: sample an increasing count of events over time and divide the change in count values by the change in time to display a rate of activity.  </p>\n<p>When sampling performance counter data, using a counter type that represents an average can make raw data values meaningful for your use. For example, the raw data counter <code>NumberOfItems64</code> can expose data that is fairly random from sample to sample. The formula for an average calculation of the values that the counter returns would be (X 0 +X 1 +…+X n)/n, where each X i is a raw counter sample.  </p>\n<p>Rate counters are similar to average counters, but more useful for situations in which the rate increases as a resource is used. A formula that quickly calculates the average is ((X n -X 0)/(T n -T 0)) / frequency, where each X i is a counter sample and each T i is the time that the corresponding sample was taken. The result is the average usage per second.  </p>\n</li>\n</ul>\n<div class=\"NOTE\"><h5>Note</h5><p> Unless otherwise indicated, the time base is seconds.  </p>\n</div>\n<p> When instrumenting applications (creating and writing custom performance counters), you might be working with performance counter types that rely on an accompanying base counter that is used in the calculations. The base counter must be immediately after its associated counter in the <a class=\"xref\" href=\"system.diagnostics.countercreationdatacollection\" data-linktype=\"relative-path\">CounterCreationDataCollection</a> collection your application uses. The following table lists the base counter types with their corresponding performance counter types.  </p>\n<table>\n<thead>\n<tr>\n<th>Base counter type</th>\n<th>Performance counter types</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>AverageBase</code></td>\n<td><code>AverageTimer32</code><br><br> <code>AverageCount64</code></td>\n</tr>\n<tr>\n<td><code>CounterMultiBase</code></td>\n<td><code>CounterMultiTimer</code><br><br> <code>CounterMultiTimerInverse</code><br><br> <code>CounterMultiTimer100Ns</code><br><br> <code>CounterMultiTimer100NsInverse</code></td>\n</tr>\n<tr>\n<td><code>RawBase</code></td>\n<td><code>RawFraction</code></td>\n</tr>\n<tr>\n<td><code>SampleBase</code></td>\n<td><code>SampleFraction</code></td>\n</tr>\n</tbody>\n</table>\n\r\n        <header class=\"header\" id=\"fields\">\r\n          <h2>Fields\r\n        </h2>\r\n        </header>\r\n        <table class=\"nameValue\">\r\n            <tbody>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_AverageBase\">\r\n            <div class=\"lang-csharp\">AverageBase</div>\r\n          </td>\r\n                <td><p>A base counter that is used in the calculation of time or count averages, such as <code>AverageTimer32</code> and <code>AverageCount64</code>. Stores the denominator for calculating a counter to present &quot;time per operation&quot; or &quot;count per operation&quot;.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_AverageCount64\">\r\n            <div class=\"lang-csharp\">AverageCount64</div>\r\n          </td>\r\n                <td><p>An average counter that shows how many items are processed, on average, during an operation. Counters of this type display a ratio of the items processed to the number of operations completed. The ratio is calculated by comparing the number of items processed during the last interval to the number of operations completed during the last interval.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_AverageTimer32\">\r\n            <div class=\"lang-csharp\">AverageTimer32</div>\r\n          </td>\r\n                <td><p>An average counter that measures the time it takes, on average, to complete a process or operation. Counters of this type display a ratio of the total elapsed time of the sample interval to the number of processes or operations completed during that time. This counter type measures time in ticks of the system clock.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterDelta32\">\r\n            <div class=\"lang-csharp\">CounterDelta32</div>\r\n          </td>\r\n                <td><p>A difference counter that shows the change in the measured attribute between the two most recent sample intervals.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterDelta64\">\r\n            <div class=\"lang-csharp\">CounterDelta64</div>\r\n          </td>\r\n                <td><p>A difference counter that shows the change in the measured attribute between the two most recent sample intervals. It is the same as the <code>CounterDelta32</code> counter type except that is uses larger fields to accomodate larger values.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterMultiBase\">\r\n            <div class=\"lang-csharp\">CounterMultiBase</div>\r\n          </td>\r\n                <td><p>A base counter that indicates the number of items sampled. It is used as the denominator in the calculations to get an average among the items sampled when taking timings of multiple, but similar items. Used with <code>CounterMultiTimer</code>, <code>CounterMultiTimerInverse</code>, <code>CounterMultiTimer100Ns</code>, and <code>CounterMultiTimer100NsInverse</code>.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterMultiTimer\">\r\n            <div class=\"lang-csharp\">CounterMultiTimer</div>\r\n          </td>\r\n                <td><p>A percentage counter that displays the active time of one or more components as a percentage of the total time of the sample interval. Because the numerator records the active time of components operating simultaneously, the resulting percentage can exceed 100 percent.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterMultiTimer100Ns\">\r\n            <div class=\"lang-csharp\">CounterMultiTimer100Ns</div>\r\n          </td>\r\n                <td><p>A percentage counter that shows the active time of one or more components as a percentage of the total time of the sample interval. It measures time in 100 nanosecond (ns) units.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterMultiTimer100NsInverse\">\r\n            <div class=\"lang-csharp\">CounterMultiTimer100NsInverse</div>\r\n          </td>\r\n                <td><p>A percentage counter that shows the active time of one or more components as a percentage of the total time of the sample interval. Counters of this type measure time in 100 nanosecond (ns) units. They derive the active time by measuring the time that the components were not active and subtracting the result from multiplying 100 percent by the number of objects monitored.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterMultiTimerInverse\">\r\n            <div class=\"lang-csharp\">CounterMultiTimerInverse</div>\r\n          </td>\r\n                <td><p>A percentage counter that shows the active time of one or more components as a percentage of the total time of the sample interval. It derives the active time by measuring the time that the components were not active and subtracting the result from 100 percent by the number of objects monitored.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterTimer\">\r\n            <div class=\"lang-csharp\">CounterTimer</div>\r\n          </td>\r\n                <td><p>A percentage counter that shows the average time that a component is active as a percentage of the total sample time.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CounterTimerInverse\">\r\n            <div class=\"lang-csharp\">CounterTimerInverse</div>\r\n          </td>\r\n                <td><p>A percentage counter that displays the average percentage of active time observed during sample interval. The value of these counters is calculated by monitoring the percentage of time that the service was inactive and then subtracting that value from 100 percent.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CountPerTimeInterval32\">\r\n            <div class=\"lang-csharp\">CountPerTimeInterval32</div>\r\n          </td>\r\n                <td><p>An average counter designed to monitor the average length of a queue to a resource over time. It shows the difference between the queue lengths observed during the last two sample intervals divided by the duration of the interval. This type of counter is typically used to track the number of items that are queued or waiting.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_CountPerTimeInterval64\">\r\n            <div class=\"lang-csharp\">CountPerTimeInterval64</div>\r\n          </td>\r\n                <td><p>An average counter that monitors the average length of a queue to a resource over time. Counters of this type display the difference between the queue lengths observed during the last two sample intervals, divided by the duration of the interval. This counter type is the same as <code>CountPerTimeInterval32</code> except that it uses larger fields to accommodate larger values. This type of counter is typically used to track a high-volume or very large number of items that are queued or waiting.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_ElapsedTime\">\r\n            <div class=\"lang-csharp\">ElapsedTime</div>\r\n          </td>\r\n                <td><p>A difference timer that shows the total time between when the component or process started and the time when this value is calculated.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_NumberOfItems32\">\r\n            <div class=\"lang-csharp\">NumberOfItems32</div>\r\n          </td>\r\n                <td><p>An instantaneous counter that shows the most recently observed value. Used, for example, to maintain a simple count of items or operations.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_NumberOfItems64\">\r\n            <div class=\"lang-csharp\">NumberOfItems64</div>\r\n          </td>\r\n                <td><p>An instantaneous counter that shows the most recently observed value. Used, for example, to maintain a simple count of a very large number of items or operations. It is the same as <code>NumberOfItems32</code> except that it uses larger fields to accommodate larger values.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_NumberOfItemsHEX32\">\r\n            <div class=\"lang-csharp\">NumberOfItemsHEX32</div>\r\n          </td>\r\n                <td><p>An instantaneous counter that shows the most recently observed value in hexadecimal format. Used, for example, to maintain a simple count of items or operations.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_NumberOfItemsHEX64\">\r\n            <div class=\"lang-csharp\">NumberOfItemsHEX64</div>\r\n          </td>\r\n                <td><p>An instantaneous counter that shows the most recently observed value. Used, for example, to maintain a simple count of a very large number of items or operations. It is the same as <code>NumberOfItemsHEX32</code> except that it uses larger fields to accommodate larger values.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_RateOfCountsPerSecond32\">\r\n            <div class=\"lang-csharp\">RateOfCountsPerSecond32</div>\r\n          </td>\r\n                <td><p>A difference counter that shows the average number of operations completed during each second of the sample interval. Counters of this type measure time in ticks of the system clock.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_RateOfCountsPerSecond64\">\r\n            <div class=\"lang-csharp\">RateOfCountsPerSecond64</div>\r\n          </td>\r\n                <td><p>A difference counter that shows the average number of operations completed during each second of the sample interval. Counters of this type measure time in ticks of the system clock. This counter type is the same as the <code>RateOfCountsPerSecond32</code> type, but it uses larger fields to accommodate larger values to track a high-volume number of items or operations per second, such as a byte-transmission rate.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_RawBase\">\r\n            <div class=\"lang-csharp\">RawBase</div>\r\n          </td>\r\n                <td><p>A base counter that stores the denominator of a counter that presents a general arithmetic fraction. Check that this value is greater than zero before using it as the denominator in a <code>RawFraction</code> value calculation.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_RawFraction\">\r\n            <div class=\"lang-csharp\">RawFraction</div>\r\n          </td>\r\n                <td><p>An instantaneous percentage counter that shows the ratio of a subset to its set as a percentage. For example, it compares the number of bytes in use on a disk to the total number of bytes on the disk. Counters of this type display the current percentage only, not an average over time.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_SampleBase\">\r\n            <div class=\"lang-csharp\">SampleBase</div>\r\n          </td>\r\n                <td><p>A base counter that stores the number of sampling interrupts taken and is used as a denominator in the sampling fraction. The sampling fraction is the number of samples that were 1 (or <code>true</code>) for a sample interrupt. Check that this value is greater than zero before using it as the denominator in a calculation of <code>SampleFraction</code>.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_SampleCounter\">\r\n            <div class=\"lang-csharp\">SampleCounter</div>\r\n          </td>\r\n                <td><p>An average counter that shows the average number of operations completed in one second. When a counter of this type samples the data, each sampling interrupt returns one or zero. The counter data is the number of ones that were sampled. It measures time in units of ticks of the system performance timer.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_SampleFraction\">\r\n            <div class=\"lang-csharp\">SampleFraction</div>\r\n          </td>\r\n                <td><p>A percentage counter that shows the average ratio of hits to all operations during the last two sample intervals.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_Timer100Ns\">\r\n            <div class=\"lang-csharp\">Timer100Ns</div>\r\n          </td>\r\n                <td><p>A percentage counter that shows the active time of a component as a percentage of the total elapsed time of the sample interval. It measures time in units of 100 nanoseconds (ns). Counters of this type are designed to measure the activity of one component at a time.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceCounterType_Timer100NsInverse\">\r\n            <div class=\"lang-csharp\">Timer100NsInverse</div>\r\n          </td>\r\n                <td><p>A percentage counter that shows the average percentage of active time observed during the sample interval.</p>\n</td>\r\n              </tr>\r\n            </tbody>\r\n        </table>\r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n","outputRootRelativePath":"./","pageMetadata":"<meta name=\"breadcrumb_path\" content=\"breadcrumb/toc1.json\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"fulldocset\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.fulldocset\">\r\n<meta name=\"ref_skeleton_gitcommit\" content=\"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/501959ac03e19ac52a27aa4c6bbeb980f8b11c8c/fulldocset/System.Diagnostics.PerformanceCounterType.yml\">\r\n<meta name=\"original_ref_skeleton_git_url\" content=\"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/master/fulldocset/System.Diagnostics.PerformanceCounterType.yml\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.AverageBase\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.AverageCount64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.AverageTimer32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterDelta32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterDelta64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterMultiBase\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterMultiTimer\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterMultiTimer100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterMultiTimer100NsInverse\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterMultiTimerInverse\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterTimer\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CounterTimerInverse\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CountPerTimeInterval32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.CountPerTimeInterval64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.ElapsedTime\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.NumberOfItems32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.NumberOfItems64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.NumberOfItemsHEX32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.NumberOfItemsHEX64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.RateOfCountsPerSecond32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.RateOfCountsPerSecond64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.RawBase\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.RawFraction\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.SampleBase\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.SampleCounter\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.SampleFraction\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.Timer100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceCounterType.Timer100NsInverse\">\r\n<meta name=\"APILocation\" content=\"System.dll\">\r\n<meta name=\"TopicType\" content=\"apiref\">\r\n<meta name=\"APIType\" content=\"Assembly\">\r\n<meta name=\"updated_at\" content=\"2017-03-01 01:37 AM\">\r\n<meta name=\"document_id\" content=\"957a9fa6-6801-ca9e-75e1-6c670dcb6ec6\">\r\n<meta name=\"original_ecmaxml_local_path\" content=\"W:\\vejk\\s\\fulldocset\\xml\\System.Diagnostics\\PerformanceCounterType.xml\">\r\n<meta name=\"pagetype\" content=\"Reference\">\r\n<meta name=\"description\" content=\"Specifies the formula used to calculate the  method for a  instance.\n\">\r\n<meta name=\"toc_rel\" content=\"_splitted/System.Diagnostics/toc1.json\">\r\n<meta name=\"source_url\" content=\"\">\r\n<meta name=\"ms.assetid\" content=\"System.Diagnostics.PerformanceCounterType\">\r\n","rawMetadata":{"breadcrumb_path":"breadcrumb/toc.json","search.ms_sitename":"Docs","search.ms_docsetname":"fulldocset","version":null,"_op_canonicalUrlPrefix":"https://ppe.docs.microsoft.com/en-us/fulldotnet/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":true,"depot_name":"MSDN.fulldocset","_op_gitRefSkeletonCommitHistory":[{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"use plugin in master","commit_sha":"501959ac03e19ac52a27aa4c6bbeb980f8b11c8c","commit_date":"2017-03-01 09:31:20 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"switch from platform to version","commit_sha":"78cdacb5ca782478af490a6b30c3a2cb2b6b873e","commit_date":"2017-02-28 15:09:51 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"update platforms","commit_sha":"39ad5a8919a59afc93a79ac4bd8e07c3b471b37a","commit_date":"2017-02-28 10:38:59 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"checkin yml","commit_sha":"da161b792852497df7140d7768cee2eccd9cb43f","commit_date":"2017-02-28 09:36:15 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"delete ymls","commit_sha":"417c04fd1daf0cb211ec4909020356fc1fe69260","commit_date":"2017-02-27 14:12:48 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"update latest xml","commit_sha":"1e40a158586a88a698e0cb5342785002a56898b2","commit_date":"2017-02-24 16:20:57 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"transform see cref and fix paramref format","commit_sha":"3d0ea34483c97ac77f4020a7f294757d67a5c1d4","commit_date":"2017-02-23 10:03:17 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"fix param transform, fix escaped xref","commit_sha":"2af997a764c82488dfa824f1c7bc4d736757d943","commit_date":"2017-02-22 17:04:48 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"convert exceptions","commit_sha":"0a5bf3370731dd35a596c91081e5dc82e2eace3a","commit_date":"2017-02-22 11:54:30 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"remove _yml from url","commit_sha":"f9314af8858edb8c329d223328490093aef4f55f","commit_date":"2017-02-17 15:31:12 +0800"}],"ref_skeleton_gitcommit":"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/501959ac03e19ac52a27aa4c6bbeb980f8b11c8c/fulldocset/System.Diagnostics.PerformanceCounterType.yml","original_ref_skeleton_git_url":"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/master/fulldocset/System.Diagnostics.PerformanceCounterType.yml","open_to_public_contributors":true,"api_name":["System.Diagnostics.PerformanceCounterType","System.Diagnostics.PerformanceCounterType.AverageBase","System.Diagnostics.PerformanceCounterType.AverageCount64","System.Diagnostics.PerformanceCounterType.AverageTimer32","System.Diagnostics.PerformanceCounterType.CounterDelta32","System.Diagnostics.PerformanceCounterType.CounterDelta64","System.Diagnostics.PerformanceCounterType.CounterMultiBase","System.Diagnostics.PerformanceCounterType.CounterMultiTimer","System.Diagnostics.PerformanceCounterType.CounterMultiTimer100Ns","System.Diagnostics.PerformanceCounterType.CounterMultiTimer100NsInverse","System.Diagnostics.PerformanceCounterType.CounterMultiTimerInverse","System.Diagnostics.PerformanceCounterType.CounterTimer","System.Diagnostics.PerformanceCounterType.CounterTimerInverse","System.Diagnostics.PerformanceCounterType.CountPerTimeInterval32","System.Diagnostics.PerformanceCounterType.CountPerTimeInterval64","System.Diagnostics.PerformanceCounterType.ElapsedTime","System.Diagnostics.PerformanceCounterType.NumberOfItems32","System.Diagnostics.PerformanceCounterType.NumberOfItems64","System.Diagnostics.PerformanceCounterType.NumberOfItemsHEX32","System.Diagnostics.PerformanceCounterType.NumberOfItemsHEX64","System.Diagnostics.PerformanceCounterType.RateOfCountsPerSecond32","System.Diagnostics.PerformanceCounterType.RateOfCountsPerSecond64","System.Diagnostics.PerformanceCounterType.RawBase","System.Diagnostics.PerformanceCounterType.RawFraction","System.Diagnostics.PerformanceCounterType.SampleBase","System.Diagnostics.PerformanceCounterType.SampleCounter","System.Diagnostics.PerformanceCounterType.SampleFraction","System.Diagnostics.PerformanceCounterType.Timer100Ns","System.Diagnostics.PerformanceCounterType.Timer100NsInverse"],"api_location":["System.dll"],"topic_type":["apiref"],"api_type":["Assembly"],"f1_keywords":["System.Diagnostics.PerformanceCounterType","System::Diagnostics::PerformanceCounterType","System.Diagnostics.PerformanceCounterType.AverageBase","System::Diagnostics::PerformanceCounterType::AverageBase","System.Diagnostics.PerformanceCounterType.AverageCount64","System::Diagnostics::PerformanceCounterType::AverageCount64","System.Diagnostics.PerformanceCounterType.AverageTimer32","System::Diagnostics::PerformanceCounterType::AverageTimer32","System.Diagnostics.PerformanceCounterType.CounterDelta32","System::Diagnostics::PerformanceCounterType::CounterDelta32","System.Diagnostics.PerformanceCounterType.CounterDelta64","System::Diagnostics::PerformanceCounterType::CounterDelta64","System.Diagnostics.PerformanceCounterType.CounterMultiBase","System::Diagnostics::PerformanceCounterType::CounterMultiBase","System.Diagnostics.PerformanceCounterType.CounterMultiTimer","System::Diagnostics::PerformanceCounterType::CounterMultiTimer","System.Diagnostics.PerformanceCounterType.CounterMultiTimer100Ns","System::Diagnostics::PerformanceCounterType::CounterMultiTimer100Ns","System.Diagnostics.PerformanceCounterType.CounterMultiTimer100NsInverse","System::Diagnostics::PerformanceCounterType::CounterMultiTimer100NsInverse","System.Diagnostics.PerformanceCounterType.CounterMultiTimerInverse","System::Diagnostics::PerformanceCounterType::CounterMultiTimerInverse","System.Diagnostics.PerformanceCounterType.CounterTimer","System::Diagnostics::PerformanceCounterType::CounterTimer","System.Diagnostics.PerformanceCounterType.CounterTimerInverse","System::Diagnostics::PerformanceCounterType::CounterTimerInverse","System.Diagnostics.PerformanceCounterType.CountPerTimeInterval32","System::Diagnostics::PerformanceCounterType::CountPerTimeInterval32","System.Diagnostics.PerformanceCounterType.CountPerTimeInterval64","System::Diagnostics::PerformanceCounterType::CountPerTimeInterval64","System.Diagnostics.PerformanceCounterType.ElapsedTime","System::Diagnostics::PerformanceCounterType::ElapsedTime","System.Diagnostics.PerformanceCounterType.NumberOfItems32","System::Diagnostics::PerformanceCounterType::NumberOfItems32","System.Diagnostics.PerformanceCounterType.NumberOfItems64","System::Diagnostics::PerformanceCounterType::NumberOfItems64","System.Diagnostics.PerformanceCounterType.NumberOfItemsHEX32","System::Diagnostics::PerformanceCounterType::NumberOfItemsHEX32","System.Diagnostics.PerformanceCounterType.NumberOfItemsHEX64","System::Diagnostics::PerformanceCounterType::NumberOfItemsHEX64","System.Diagnostics.PerformanceCounterType.RateOfCountsPerSecond32","System::Diagnostics::PerformanceCounterType::RateOfCountsPerSecond32","System.Diagnostics.PerformanceCounterType.RateOfCountsPerSecond64","System::Diagnostics::PerformanceCounterType::RateOfCountsPerSecond64","System.Diagnostics.PerformanceCounterType.RawBase","System::Diagnostics::PerformanceCounterType::RawBase","System.Diagnostics.PerformanceCounterType.RawFraction","System::Diagnostics::PerformanceCounterType::RawFraction","System.Diagnostics.PerformanceCounterType.SampleBase","System::Diagnostics::PerformanceCounterType::SampleBase","System.Diagnostics.PerformanceCounterType.SampleCounter","System::Diagnostics::PerformanceCounterType::SampleCounter","System.Diagnostics.PerformanceCounterType.SampleFraction","System::Diagnostics::PerformanceCounterType::SampleFraction","System.Diagnostics.PerformanceCounterType.Timer100Ns","System::Diagnostics::PerformanceCounterType::Timer100Ns","System.Diagnostics.PerformanceCounterType.Timer100NsInverse","System::Diagnostics::PerformanceCounterType::Timer100NsInverse"],"dev_langs":["csharp"],"updated_at":"2017-03-01 01:37 AM","document_id":"957a9fa6-6801-ca9e-75e1-6c670dcb6ec6","original_ecmaxml_local_path":"W:\\vejk\\s\\fulldocset\\xml\\System.Diagnostics\\PerformanceCounterType.xml","content_git_url":"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/master/fulldocset/xml/System.Diagnostics/PerformanceCounterType.xml","layout":"Reference","_op_layout":"Reference","pagetype":"Reference","title":"PerformanceCounterType enum | Microsoft Docs","_op_ogTitle":"PerformanceCounterType enum","description":"Specifies the formula used to calculate the  method for a  instance.\n","toc_asset_id":"_splitted/System.Diagnostics/toc.json","toc_rel":"_splitted/System.Diagnostics/toc.json","source_url":"","ms.assetid":"System.Diagnostics.PerformanceCounterType","canonical_url":"https://ppe.docs.microsoft.com/en-us/mergedepotdynamic/system.diagnostics.performancecountertype","_op_canonicalUrl":"https://ppe.docs.microsoft.com/en-us/mergedepotdynamic/system.diagnostics.performancecountertype","fileRelativePath":"System.Diagnostics.PerformanceCounterType.html"},"themesRelativePathToOutputRoot":"_themes/"}