{"content":"    <!-- ENUM -->\r\n    <h1 id=\"System_Diagnostics_PerformanceData_CounterType\">\r\n      <span class=\"lang-csharp\">CounterType</span>\r\n        Enum\r\n    </h1>\r\n    \r\n    \r\n    <nav id=\"center-doc-outline\" class=\"doc-outline\" ms.cmpgrp=\"intopic toc\" role=\"navigation\" aria-label=\"On page navigation\">\r\n      <h3>In this Article</h3>\r\n    </nav><div class=\"summary\">\r\n    \t<p>Defines the possible types of counters. Each counter is assigned a counter type. The counter type determines how the counter data is calculated, averaged, and displayed.</p>\n\r\n    </div><h2>Syntax</h2>\r\n    \r\n    \t<h3>Declaration</h3>\r\n    \t<pre class=\"memberDeclaration\"><code class=\"csharp lang-csharp\">public enum CounterType</code></pre>\r\n    \r\n    \r\n    \r\n    <h3>Inheritance Hierarchy</h3>\r\n    <ul class=\"inheritance\">\r\n        <li class=\"l0\">\r\n          <div class=\"lang-csharp\">\r\n            <a class=\"xref\" href=\"system.object\" data-linktype=\"relative-path\">Object</a>\r\n          </div>\r\n        </li>\r\n        <li class=\"l1\">\r\n          <div class=\"lang-csharp\">\r\n            <a class=\"xref\" href=\"system.valuetype\" data-linktype=\"relative-path\">ValueType</a>\r\n          </div>\r\n        </li>\r\n        <li class=\"l2\">\r\n          <div class=\"lang-csharp\">\r\n            <a class=\"xref\" href=\"system.enum\" data-linktype=\"relative-path\">System.Enum</a>\r\n          </div>\r\n        </li>\r\n      <li class=\"l3\">\r\n        <div class=\"xref\">\r\n          <div class=\"lang-csharp\">CounterType</div>\r\n        </div>\r\n      </li>\r\n    </ul>\r\n    \r\n    \r\n    \r\n      <h2>Remarks</h2>\r\n      <p>For details on the types listed in this enumeration, see the Counter Types section of the <a href=\"http://go.microsoft.com/FWLink/?LinkId=84422\" data-linktype=\"external\">Windows Server 2003 Deployment Kit</a>.</p>\n\r\n        <header class=\"header\" id=\"fields\">\r\n          <h2>Fields\r\n        </h2>\r\n        </header>\r\n        <table class=\"nameValue\">\r\n            <tbody>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_AverageBase\">\r\n            <div class=\"lang-csharp\">AverageBase</div>\r\n          </td>\r\n                <td><p>This counter is used as the base data (denominator) in the computation of time or count averages for the AverageCount64 and AverageTimer32 counter types. This counter type collects the last observed value only. (See the PERF_AVERAGE_BASE counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_AverageCount64\">\r\n            <div class=\"lang-csharp\">AverageCount64</div>\r\n          </td>\r\n                <td><p>This counter type shows how many items are processed, on average, during an operation. Counters of this type display a ratio of the items processed (such as bytes sent) to the number of operations completed. The ratio is calculated by comparing the number of items processed during the last interval to the number of operations completed during the last interval. (See the PERF_AVERAGE_BULK counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_AverageTimer32\">\r\n            <div class=\"lang-csharp\">AverageTimer32</div>\r\n          </td>\r\n                <td><p>This counter type measures the average time it takes to complete a process or operation. Counters of this type display a ratio of the total elapsed time of the sample interval to the number of processes or operations completed during that time. This counter type measures time in ticks of the system clock. (See the PERF_AVERAGE_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_Delta32\">\r\n            <div class=\"lang-csharp\">Delta32</div>\r\n          </td>\r\n                <td><p>This counter type shows the change in the measured attribute between the two most recent sample intervals. (See the PERF_COUNTER_DELTA counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_Delta64\">\r\n            <div class=\"lang-csharp\">Delta64</div>\r\n          </td>\r\n                <td><p>This counter type shows the change in the measured attribute between the two most recent sample intervals. It is the same as the Delta32 counter type, except that it uses larger fields to accommodate larger values. (See the PERF_COUNTER_LARGE_DELTA counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_ElapsedTime\">\r\n            <div class=\"lang-csharp\">ElapsedTime</div>\r\n          </td>\r\n                <td><p>This counter type shows the total time between when the component or process started and the time when this value is calculated. (See the PERF_ELAPSED_TIME counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_LargeQueueLength\">\r\n            <div class=\"lang-csharp\">LargeQueueLength</div>\r\n          </td>\r\n                <td><p>This counter type monitors the average length of a queue to a resource over time. Counters of this type display the difference between the queue lengths observed during the last two sample intervals, divided by the duration of the interval. This counter type is the same as the QueueLength counter type, except that it uses larger fields to accommodate larger values. (See the PERF_COUNTER_LARGE_QUEUELEN_TYPE counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_MultiTimerBase\">\r\n            <div class=\"lang-csharp\">MultiTimerBase</div>\r\n          </td>\r\n                <td><p>Indicates the number of items sampled. It is used as the denominator in the calculations to get an average among the items sampled when taking timings of multiple, but similar, items. This type supports the following counter types: MultiTimerPercentageActive, MultiTimerPercentageNotActive, MultiTimerPercentageActive100Ns, and MultiTimerPercentageNotActive100Ns.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_MultiTimerPercentageActive\">\r\n            <div class=\"lang-csharp\">MultiTimerPercentageActive</div>\r\n          </td>\r\n                <td><p>This counter type is a multitimer. Multitimers collect data from more than one instance of a component, such as a processor or disk. Counters of this type display the active time of one or more components as a percentage of the total time of the sample interval. Because the numerator records the active time of components operating simultaneously, the resulting percentage can exceed 100 percent. This counter type differs from MultiTimerPercentageActive100Ns in that it measures time in units of ticks of the system performance timer, rather than in 100 nanosecond units. (See the PERF_COUNTER_MULTI_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_MultiTimerPercentageActive100Ns\">\r\n            <div class=\"lang-csharp\">MultiTimerPercentageActive100Ns</div>\r\n          </td>\r\n                <td><p>This counter type shows the active time of one or more components as a percentage of the total time of the sample interval. It measures time in 100 nanosecond units. This counter type is a multitimer. Multitimers are designed to monitor more than one instance of a component, such as a processor or disk. (See the PERF_100NSEC_MULTI_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_MultiTimerPercentageNotActive\">\r\n            <div class=\"lang-csharp\">MultiTimerPercentageNotActive</div>\r\n          </td>\r\n                <td><p>This counter type shows the active time of one or more components as a percentage of the total time of the sample interval. This counter type is an inverse multitimer. Multitimers monitor more than one instance of a component, such as a processor or disk. Inverse counters measure the time that a component is not active and derive the active time from that measurement. This counter differs from MultiTimerPercentageNotActive100Ns in that it measures time in units of ticks of the system performance timer, rather than in 100 nanosecond units. (See the PERF_COUNTER_MULTI_TIMER_INV counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_MultiTimerPercentageNotActive100Ns\">\r\n            <div class=\"lang-csharp\">MultiTimerPercentageNotActive100Ns</div>\r\n          </td>\r\n                <td><p>This counter type shows the active time of one or more components as a percentage of the total time of the sample interval. Counters of this type measure time in 100 nanosecond units. This counter type is an inverse multitimer. Multitimers are designed to monitor more than one instance of a component, such as a processor or disk. Inverse counters measure the time that a component is not active and derive its active time from the measurement of inactive time. (See the PERF_100NSEC_MULTI_TIMER_INV counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_ObjectSpecificTimer\">\r\n            <div class=\"lang-csharp\">ObjectSpecificTimer</div>\r\n          </td>\r\n                <td><p>This 64-bit counter type is a timer that displays in object-specific units. (See the PERF_OBJ_TIME_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_PercentageActive\">\r\n            <div class=\"lang-csharp\">PercentageActive</div>\r\n          </td>\r\n                <td><p>This counter type shows the average time that a component was active as a percentage of the total sample time. (See the PERF_COUNTER_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_PercentageActive100Ns\">\r\n            <div class=\"lang-csharp\">PercentageActive100Ns</div>\r\n          </td>\r\n                <td><p>This counter type shows the active time of a component as a percentage of the total elapsed time of the sample interval. It measures time in units of 100 nanoseconds. Counters of this type are designed to measure the activity of one component at a time. (See the PERF_100NSEC_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_PercentageNotActive\">\r\n            <div class=\"lang-csharp\">PercentageNotActive</div>\r\n          </td>\r\n                <td><p>This is an inverse counter type. Inverse counters measure the time that a component is not active and derive the active time from that measurement. Counters of this type display the average percentage of active time observed during sample interval. The value of these counters is calculated by monitoring the percentage of time that the service was inactive and then subtracting that value from 100 percent. This counter type is the same as the PercentageNotActive100Ns counter type, except that it measures time in units of ticks of the system performance timer, rather than in 100 nanosecond units. (See the PERF_COUNTER_TIMER_INV counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_PercentageNotActive100Ns\">\r\n            <div class=\"lang-csharp\">PercentageNotActive100Ns</div>\r\n          </td>\r\n                <td><p>This counter type shows the average percentage of active time observed during the sample interval. This is an inverse counter. Inverse counters are calculated by monitoring the percentage of time that the service was inactive and then subtracting that value from 100 percent. (See the PERF_100NSEC_TIMER_INV counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_PrecisionObjectSpecificTimer\">\r\n            <div class=\"lang-csharp\">PrecisionObjectSpecificTimer</div>\r\n          </td>\r\n                <td><p>This counter type shows a value that consists of two counter values: the count of the elapsed time of the event being monitored, and the frequency specified in the PerfFreq field of the object header. This counter type differs from other counter timers in that the clock tick value accompanies the counter value so as to eliminate any possible difference due to latency from the function call. Precision counter types are used when standard system timers are not precise enough for accurate readings. (See the PERF_PRECISION_OBJECT_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_PrecisionSystemTimer\">\r\n            <div class=\"lang-csharp\">PrecisionSystemTimer</div>\r\n          </td>\r\n                <td><p>This counter type shows a value that consists of two counter values: the count of the elapsed time of the event being monitored, and the frequency from the system performance timer. This counter type differs from other counter timers in that the clock tick value accompanies the counter value, eliminating any possible difference due to latency from the function call. Precision counter types are used when standard system timers are not precise enough for accurate readings. (See the PERF_PRECISION_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_PrecisionTimer100Ns\">\r\n            <div class=\"lang-csharp\">PrecisionTimer100Ns</div>\r\n          </td>\r\n                <td><p>This counter type shows a value that consists of two counter values: the count of the elapsed time of the event being monitored, and the &quot;clock&quot; time from a private timer in the same units. It measures time in 100 nanosecond units. This counter type differs from other counter timers in that the clock tick value accompanies the counter value eliminating any possible difference due to latency from the function call. Precision counter types are used when standard system timers are not precise enough for accurate readings. (See the PERF_PRECISION_100NS_TIMER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_QueueLength\">\r\n            <div class=\"lang-csharp\">QueueLength</div>\r\n          </td>\r\n                <td><p>This counter type is designed to monitor the average length of a queue to a resource over time. It shows the difference between the queue lengths observed during the last two sample intervals divided by the duration of the interval. (See the PERF_COUNTER_QUEUELEN_TYPE counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_QueueLength100Ns\">\r\n            <div class=\"lang-csharp\">QueueLength100Ns</div>\r\n          </td>\r\n                <td><p>This counter type measures the queue-length space-time product using a 100-nanosecond time base. (See the PERF_COUNTER_100NS_QUEUELEN_TYPE counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_QueueLengthObjectTime\">\r\n            <div class=\"lang-csharp\">QueueLengthObjectTime</div>\r\n          </td>\r\n                <td><p>This counter type measures the queue-length space-time product using an object-specific time base. (See the PERF_COUNTER_OBJ_QUEUELEN_TYPE counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RateOfCountPerSecond32\">\r\n            <div class=\"lang-csharp\">RateOfCountPerSecond32</div>\r\n          </td>\r\n                <td><p>This counter type shows the average number of operations completed during each second of the sample interval. Counters of this type measure time in ticks of the system clock. (See the PERF_COUNTER_COUNTER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RateOfCountPerSecond64\">\r\n            <div class=\"lang-csharp\">RateOfCountPerSecond64</div>\r\n          </td>\r\n                <td><p>This counter type shows the average number of operations completed during each second of the sample interval. Counters of this type measure time in ticks of the system clock. This counter type is the same as the RateOfCountPerSecond32 type, but it uses larger fields to accommodate larger values. (See the PERF_COUNTER_BULK_COUNT counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawBase32\">\r\n            <div class=\"lang-csharp\">RawBase32</div>\r\n          </td>\r\n                <td><p>This counter type collects the last observed value only. The value is used as the denominator of a counter that presents a general arithmetic fraction. This type supports the RawFraction32 counter type. (See the PERF_RAW_BASE counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawBase64\">\r\n            <div class=\"lang-csharp\">RawBase64</div>\r\n          </td>\r\n                <td><p>This counter type collects the last observed value. It is the same as the RawBase32counter type except that it uses larger fields to accommodate larger values. This type supports the RawFraction64 counter type. (See the PERF_LARGE_RAW_BASE counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawData32\">\r\n            <div class=\"lang-csharp\">RawData32</div>\r\n          </td>\r\n                <td><p>This counter type shows the last observed value only. It does not display an average. (See the PERF_COUNTER_RAWCOUNT counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawData64\">\r\n            <div class=\"lang-csharp\">RawData64</div>\r\n          </td>\r\n                <td><p>This counter type shows the last observed value only, not an average. It is the same as the RawData32 counter type, except that it uses larger fields to accommodate larger values. (See the PERF_COUNTER_LARGE_RAWCOUNT counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawDataHex32\">\r\n            <div class=\"lang-csharp\">RawDataHex32</div>\r\n          </td>\r\n                <td><p>This counter type shows the most recently observed value, in hexadecimal format. It does not display an average. (See the PERF_COUNTER_RAWCOUNT_HEX counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawDataHex64\">\r\n            <div class=\"lang-csharp\">RawDataHex64</div>\r\n          </td>\r\n                <td><p>This counter type shows the last observed value, in hexadecimal format. It is the same as the RawDataHex32 counter type, except that it uses larger fields to accommodate larger values. (See the PERF_COUNTER_LARGE_RAWCOUNT_HEX counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawFraction32\">\r\n            <div class=\"lang-csharp\">RawFraction32</div>\r\n          </td>\r\n                <td><p>This counter type shows the ratio of a subset to its set as a percentage. For example, it compares the number of bytes in use on a disk to the total number of bytes on the disk. Counters of this type display the current percentage only, not an average over time. (See the PERF_RAW_FRACTION counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_RawFraction64\">\r\n            <div class=\"lang-csharp\">RawFraction64</div>\r\n          </td>\r\n                <td><p>This counter type shows the ratio of a subset to its set as a percentage. For example, it compares the number of bytes in use on a disk to the total number of bytes on the disk. Counters of this type display the current percentage only, not an average over time. It is the same as the RawFraction32 counter type, except that it uses larger fields to accommodate larger values.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_SampleBase\">\r\n            <div class=\"lang-csharp\">SampleBase</div>\r\n          </td>\r\n                <td><p>This counter stores the number of sampling interrupts taken and is used as a denominator in the sampling fraction. This type supports the SampleFraction counter type.</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_SampleCounter\">\r\n            <div class=\"lang-csharp\">SampleCounter</div>\r\n          </td>\r\n                <td><p>This counter type shows the average number of operations completed in one second. It measures time in units of ticks of the system performance timer. The variable F represents the number of ticks that occur in one second. The value of F is factored into the equation so that the result is displayed in seconds. (See the PERF_SAMPLE_COUNTER counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n              <tr>\r\n                <td id=\"System_Diagnostics_PerformanceData_CounterType_SampleFraction\">\r\n            <div class=\"lang-csharp\">SampleFraction</div>\r\n          </td>\r\n                <td><p>This counter type shows the average ratio of hits to all operations during the last two sample intervals. (See the PERF_SAMPLE_FRACTION counter type in the deployment kit.)</p>\n</td>\r\n              </tr>\r\n            </tbody>\r\n        </table>\r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n    \r\n","outputRootRelativePath":"./","pageMetadata":"<meta name=\"breadcrumb_path\" content=\"breadcrumb/toc.json\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"fulldocset\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.fulldocset\">\r\n<meta name=\"ref_skeleton_gitcommit\" content=\"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/417c04fd1daf0cb211ec4909020356fc1fe69260/fulldocset/System.Diagnostics.PerformanceData.CounterType.yml\">\r\n<meta name=\"original_ref_skeleton_git_url\" content=\"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/master/fulldocset/System.Diagnostics.PerformanceData.CounterType.yml\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.AverageBase\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.AverageCount64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.AverageTimer32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.Delta32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.Delta64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.ElapsedTime\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.LargeQueueLength\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.MultiTimerBase\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.ObjectSpecificTimer\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.PercentageActive\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.PercentageActive100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.PercentageNotActive\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.PercentageNotActive100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.PrecisionObjectSpecificTimer\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.PrecisionSystemTimer\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.PrecisionTimer100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.QueueLength\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.QueueLength100Ns\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.QueueLengthObjectTime\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RateOfCountPerSecond32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RateOfCountPerSecond64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawBase32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawBase64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawData32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawData64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawDataHex32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawDataHex64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawFraction32\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.RawFraction64\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.SampleBase\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.SampleCounter\">\r\n<meta name=\"APIName\" content=\"System.Diagnostics.PerformanceData.CounterType.SampleFraction\">\r\n<meta name=\"APILocation\" content=\"System.Core.dll\">\r\n<meta name=\"TopicType\" content=\"apiref\">\r\n<meta name=\"APIType\" content=\"Assembly\">\r\n<meta name=\"updated_at\" content=\"2017-02-28 06:06 AM\">\r\n<meta name=\"document_id\" content=\"b3885dac-dd7d-7d43-1c2b-efcc02fb08b6\">\r\n<meta name=\"pagetype\" content=\"Reference\">\r\n<meta name=\"description\" content=\"Defines the possible types of counters. Each counter is assigned a counter type. The counter type determines how the counter data is calculated, averaged, and displayed.\n\">\r\n<meta name=\"toc_rel\" content=\"_splitted/System.Diagnostics.PerformanceData/toc.json\">\r\n<meta name=\"source_url\" content=\"\">\r\n<meta name=\"ms.assetid\" content=\"System.Diagnostics.PerformanceData.CounterType\">\r\n","rawMetadata":{"breadcrumb_path":"breadcrumb/toc.json","search.ms_sitename":"Docs","search.ms_docsetname":"fulldocset","version":null,"_op_canonicalUrlPrefix":"https://ppe.docs.microsoft.com/en-us/fulldotnet/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":true,"depot_name":"MSDN.fulldocset","_op_gitRefSkeletonCommitHistory":[{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"delete ymls","commit_sha":"417c04fd1daf0cb211ec4909020356fc1fe69260","commit_date":"2017-02-27 14:12:48 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"convert exceptions","commit_sha":"0a5bf3370731dd35a596c91081e5dc82e2eace3a","commit_date":"2017-02-22 11:54:30 +0800"},{"author_name":"Tianqi Zhang","author_email":"tianzh@microsoft.com","committer_name":"Tianqi Zhang","comitter_email":"tianzh@microsoft.com","message":"remove _yml from url","commit_sha":"f9314af8858edb8c329d223328490093aef4f55f","commit_date":"2017-02-17 15:31:12 +0800"}],"ref_skeleton_gitcommit":"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/417c04fd1daf0cb211ec4909020356fc1fe69260/fulldocset/System.Diagnostics.PerformanceData.CounterType.yml","original_ref_skeleton_git_url":"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/master/fulldocset/System.Diagnostics.PerformanceData.CounterType.yml","open_to_public_contributors":true,"api_name":["System.Diagnostics.PerformanceData.CounterType","System.Diagnostics.PerformanceData.CounterType.AverageBase","System.Diagnostics.PerformanceData.CounterType.AverageCount64","System.Diagnostics.PerformanceData.CounterType.AverageTimer32","System.Diagnostics.PerformanceData.CounterType.Delta32","System.Diagnostics.PerformanceData.CounterType.Delta64","System.Diagnostics.PerformanceData.CounterType.ElapsedTime","System.Diagnostics.PerformanceData.CounterType.LargeQueueLength","System.Diagnostics.PerformanceData.CounterType.MultiTimerBase","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive100Ns","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive100Ns","System.Diagnostics.PerformanceData.CounterType.ObjectSpecificTimer","System.Diagnostics.PerformanceData.CounterType.PercentageActive","System.Diagnostics.PerformanceData.CounterType.PercentageActive100Ns","System.Diagnostics.PerformanceData.CounterType.PercentageNotActive","System.Diagnostics.PerformanceData.CounterType.PercentageNotActive100Ns","System.Diagnostics.PerformanceData.CounterType.PrecisionObjectSpecificTimer","System.Diagnostics.PerformanceData.CounterType.PrecisionSystemTimer","System.Diagnostics.PerformanceData.CounterType.PrecisionTimer100Ns","System.Diagnostics.PerformanceData.CounterType.QueueLength","System.Diagnostics.PerformanceData.CounterType.QueueLength100Ns","System.Diagnostics.PerformanceData.CounterType.QueueLengthObjectTime","System.Diagnostics.PerformanceData.CounterType.RateOfCountPerSecond32","System.Diagnostics.PerformanceData.CounterType.RateOfCountPerSecond64","System.Diagnostics.PerformanceData.CounterType.RawBase32","System.Diagnostics.PerformanceData.CounterType.RawBase64","System.Diagnostics.PerformanceData.CounterType.RawData32","System.Diagnostics.PerformanceData.CounterType.RawData64","System.Diagnostics.PerformanceData.CounterType.RawDataHex32","System.Diagnostics.PerformanceData.CounterType.RawDataHex64","System.Diagnostics.PerformanceData.CounterType.RawFraction32","System.Diagnostics.PerformanceData.CounterType.RawFraction64","System.Diagnostics.PerformanceData.CounterType.SampleBase","System.Diagnostics.PerformanceData.CounterType.SampleCounter","System.Diagnostics.PerformanceData.CounterType.SampleFraction"],"api_location":["System.Core.dll"],"topic_type":["apiref"],"api_type":["Assembly"],"f1_keywords":["System.Diagnostics.PerformanceData.CounterType","System::Diagnostics::PerformanceData::CounterType","System.Diagnostics.PerformanceData.CounterType.AverageBase","System::Diagnostics::PerformanceData::CounterType::AverageBase","System.Diagnostics.PerformanceData.CounterType.AverageCount64","System::Diagnostics::PerformanceData::CounterType::AverageCount64","System.Diagnostics.PerformanceData.CounterType.AverageTimer32","System::Diagnostics::PerformanceData::CounterType::AverageTimer32","System.Diagnostics.PerformanceData.CounterType.Delta32","System::Diagnostics::PerformanceData::CounterType::Delta32","System.Diagnostics.PerformanceData.CounterType.Delta64","System::Diagnostics::PerformanceData::CounterType::Delta64","System.Diagnostics.PerformanceData.CounterType.ElapsedTime","System::Diagnostics::PerformanceData::CounterType::ElapsedTime","System.Diagnostics.PerformanceData.CounterType.LargeQueueLength","System::Diagnostics::PerformanceData::CounterType::LargeQueueLength","System.Diagnostics.PerformanceData.CounterType.MultiTimerBase","System::Diagnostics::PerformanceData::CounterType::MultiTimerBase","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive","System::Diagnostics::PerformanceData::CounterType::MultiTimerPercentageActive","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive100Ns","System::Diagnostics::PerformanceData::CounterType::MultiTimerPercentageActive100Ns","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive","System::Diagnostics::PerformanceData::CounterType::MultiTimerPercentageNotActive","System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive100Ns","System::Diagnostics::PerformanceData::CounterType::MultiTimerPercentageNotActive100Ns","System.Diagnostics.PerformanceData.CounterType.ObjectSpecificTimer","System::Diagnostics::PerformanceData::CounterType::ObjectSpecificTimer","System.Diagnostics.PerformanceData.CounterType.PercentageActive","System::Diagnostics::PerformanceData::CounterType::PercentageActive","System.Diagnostics.PerformanceData.CounterType.PercentageActive100Ns","System::Diagnostics::PerformanceData::CounterType::PercentageActive100Ns","System.Diagnostics.PerformanceData.CounterType.PercentageNotActive","System::Diagnostics::PerformanceData::CounterType::PercentageNotActive","System.Diagnostics.PerformanceData.CounterType.PercentageNotActive100Ns","System::Diagnostics::PerformanceData::CounterType::PercentageNotActive100Ns","System.Diagnostics.PerformanceData.CounterType.PrecisionObjectSpecificTimer","System::Diagnostics::PerformanceData::CounterType::PrecisionObjectSpecificTimer","System.Diagnostics.PerformanceData.CounterType.PrecisionSystemTimer","System::Diagnostics::PerformanceData::CounterType::PrecisionSystemTimer","System.Diagnostics.PerformanceData.CounterType.PrecisionTimer100Ns","System::Diagnostics::PerformanceData::CounterType::PrecisionTimer100Ns","System.Diagnostics.PerformanceData.CounterType.QueueLength","System::Diagnostics::PerformanceData::CounterType::QueueLength","System.Diagnostics.PerformanceData.CounterType.QueueLength100Ns","System::Diagnostics::PerformanceData::CounterType::QueueLength100Ns","System.Diagnostics.PerformanceData.CounterType.QueueLengthObjectTime","System::Diagnostics::PerformanceData::CounterType::QueueLengthObjectTime","System.Diagnostics.PerformanceData.CounterType.RateOfCountPerSecond32","System::Diagnostics::PerformanceData::CounterType::RateOfCountPerSecond32","System.Diagnostics.PerformanceData.CounterType.RateOfCountPerSecond64","System::Diagnostics::PerformanceData::CounterType::RateOfCountPerSecond64","System.Diagnostics.PerformanceData.CounterType.RawBase32","System::Diagnostics::PerformanceData::CounterType::RawBase32","System.Diagnostics.PerformanceData.CounterType.RawBase64","System::Diagnostics::PerformanceData::CounterType::RawBase64","System.Diagnostics.PerformanceData.CounterType.RawData32","System::Diagnostics::PerformanceData::CounterType::RawData32","System.Diagnostics.PerformanceData.CounterType.RawData64","System::Diagnostics::PerformanceData::CounterType::RawData64","System.Diagnostics.PerformanceData.CounterType.RawDataHex32","System::Diagnostics::PerformanceData::CounterType::RawDataHex32","System.Diagnostics.PerformanceData.CounterType.RawDataHex64","System::Diagnostics::PerformanceData::CounterType::RawDataHex64","System.Diagnostics.PerformanceData.CounterType.RawFraction32","System::Diagnostics::PerformanceData::CounterType::RawFraction32","System.Diagnostics.PerformanceData.CounterType.RawFraction64","System::Diagnostics::PerformanceData::CounterType::RawFraction64","System.Diagnostics.PerformanceData.CounterType.SampleBase","System::Diagnostics::PerformanceData::CounterType::SampleBase","System.Diagnostics.PerformanceData.CounterType.SampleCounter","System::Diagnostics::PerformanceData::CounterType::SampleCounter","System.Diagnostics.PerformanceData.CounterType.SampleFraction","System::Diagnostics::PerformanceData::CounterType::SampleFraction"],"dev_langs":["csharp"],"updated_at":"2017-02-28 06:06 AM","document_id":"b3885dac-dd7d-7d43-1c2b-efcc02fb08b6","content_git_url":"https://github.com/TianqiZhang/ECMA2YamlTestRepo2/blob/master/fulldocset/xml/System.Diagnostics.PerformanceData/CounterType.xml","layout":"Reference","_op_layout":"Reference","pagetype":"Reference","title":"CounterType enum | Microsoft Docs","_op_ogTitle":"CounterType enum","description":"Defines the possible types of counters. Each counter is assigned a counter type. The counter type determines how the counter data is calculated, averaged, and displayed.\n","toc_asset_id":"_splitted/System.Diagnostics.PerformanceData/toc.json","toc_rel":"_splitted/System.Diagnostics.PerformanceData/toc.json","source_url":"","ms.assetid":"System.Diagnostics.PerformanceData.CounterType","canonical_url":"https://ppe.docs.microsoft.com/en-us/mergedepotdynamic/system.diagnostics.performancedata.countertype","_op_canonicalUrl":"https://ppe.docs.microsoft.com/en-us/mergedepotdynamic/system.diagnostics.performancedata.countertype","fileRelativePath":"System.Diagnostics.PerformanceData.CounterType.html"},"themesRelativePathToOutputRoot":"_themes/"}